<template>
  <div class="about pb-5">
    <div class="py-4">
      <div class="page-title">เกี่ยวกับเรา</div>
    </div>
    <div class="mx-5">
      <b-row class="content">
        <b-col lg="6" class="d-none d-sm-block">
          <img src="@/assets/image/car12.jpg" width="100%" />
        </b-col>
        <b-col lg="6">
          Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
          ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
          มันได้กลายมาเป็นเนื้อหาจำลองมาตรฐานของธุรกิจดังกล่าวมาตั้งแต่ศตวรรษที่
          16
          เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
          Lorem Ipsum อยู่ยงคงกระพันมาไม่ใช่แค่เพียงห้าศตวรรษ
          แต่อยู่มาจนถึงยุคที่พลิกโฉมเข้าสู่งานเรียงพิมพ์ด้วยวิธีทางอิเล็กทรอนิกส์
          และยังคงสภาพเดิมไว้อย่างไม่มีการเปลี่ยนแปลง
          มันได้รับความนิยมมากขึ้นในยุค ค.ศ. 1960 เมื่อแผ่น Letraset
          วางจำหน่ายโดยมีข้อความบนนั้นเป็น Lorem Ipsum และล่าสุดกว่านั้น
          คือเมื่อซอฟท์แวร์การทำสื่อสิ่งพิมพ์ (Desktop Publishing) อย่าง Aldus
          PageMaker ได้รวมเอา Lorem Ipsum เวอร์ชั่นต่างๆ เข้าไว้ในซอฟท์แวร์ด้วย
        </b-col>
      </b-row>
    </div>
  </div>
</template>
