<template>
  <div class="detail pb-2">
    <b-row class="p-3">
      <div class="title">
        <div class="title-circle">
          <img src="@/assets/image/car.png" />
        </div>
        <div class="title-text">
          ซื้อผลิตภัณฑ์ง่าย ๆ กับ SMART SURE
        </div>
      </div>
      <div class="inside mx-5">
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            เงื่อนไขการให้บริการ
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
              มันได้กลายมาเป็นเนื้อหาจำลองมาตรฐานของธุรกิจดังกล่าวมาตั้งแต่ศตวรรษที่
              16
              เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
              เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
              เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            ระยะเวลาการรับผิดชอบบริการ
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            รับผิดชอบสูงสุด
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            สิทธิพิเศษ
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            รถที่ไม่สามารถได้รับความคุ้มครอง
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            รายละเอียดความคุ้มครอง
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
            </div>
          </b-col>
        </b-row>
        <hr />
        <b-row>
          <b-col lg="3" class="font-weight-bold">
            หมายเหตุ
          </b-col>
          <b-col lg="9">
            <div>
              Lorem Ipsum คืออะไร? Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
              มันได้กลายมาเป็นเนื้อหาจำลองมาตรฐานของธุรกิจดังกล่าวมาตั้งแต่ศตวรรษที่
              16
              เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
              Lorem Ipsum อยู่ยงคงกระพันมาไม่ใช่แค่เพียงห้าศตวรรษ
              แต่อยู่มาจนถึงยุคที่พลิกโฉมเข้าสู่งานเรียงพิมพ์ด้วยวิธีทางอิเล็กทรอนิกส์
              และยังคงสภาพเดิมไว้อย่างไม่มีการเปลี่ยนแปลง
              มันได้รับความนิยมมากขึ้นในยุค ค.ศ. 1960 เมื่อแผ่น Letraset
              วางจำหน่ายโดยมีข้อความบนนั้นเป็น Lorem Ipsum และล่าสุดกว่านั้น
              คือเมื่อซอฟท์แวร์การทำสื่อสิ่งพิมพ์ (Desktop Publishing) อย่าง
              Aldus PageMaker ได้รวมเอา Lorem Ipsum เวอร์ชั่นต่างๆ
              เข้าไว้ในซอฟท์แวร์ด้วย ทำไมจึงต้องนำมาใช้? Lorem Ipsum คืออะไร?
              Lorem Ipsum คือ เนื้อหาจำลองแบบเรียบๆ
              ที่ใช้กันในธุรกิจงานพิมพ์หรืองานเรียงพิมพ์
              มันได้กลายมาเป็นเนื้อหาจำลองมาตรฐานของธุรกิจดังกล่าวมาตั้งแต่ศตวรรษที่
              16
              เมื่อเครื่องพิมพ์โนเนมเครื่องหนึ่งนำรางตัวพิมพ์มาสลับสับตำแหน่งตัวอักษรเพื่อทำหนังสือตัวอย่าง
              Lorem Ipsum อยู่ยงคงกระพันมาไม่ใช่แค่เพียงห้าศตวรรษ
              แต่อยู่มาจนถึงยุคที่พลิกโฉมเข้าสู่งานเรียงพิมพ์ด้วยวิธีทางอิเล็กทรอนิกส์
              และยังคงสภาพเดิมไว้อย่างไม่มีการเปลี่ยนแปลง
              มันได้รับความนิยมมากขึ้นในยุค ค.ศ. 1960 เมื่อแผ่น Letraset
              วางจำหน่ายโดยมีข้อความบนนั้นเป็น Lorem Ipsum และล่าสุดกว่านั้น
              คือเมื่อซอฟท์แวร์การทำสื่อสิ่งพิมพ์ (Desktop Publishing) อย่าง
              Aldus PageMaker ได้รวมเอา Lorem Ipsum เวอร์ชั่นต่างๆ
              เข้าไว้ในซอฟท์แวร์ด้วย ทำไมจึงต้องนำมาใช้?
              มีหลักฐานที่เป็นข้อเท็จจริงยืนยันมานานแล้ว
              ว่าเนื้อหาที่อ่านรู้เรื่องนั้นจะไปกวนสมาธิของคนอ่านให้เขวไปจากส่วนที้เป็น
              Layout เรานำ Lorem Ipsum
              มาใช้เพราะความที่มันมีการกระจายของตัวอักษรธรรมดาๆ แบบพอประมาณ
              ซึ่งเอามาใช้แทนการเขียนว่า ‘ตรงนี้เป็นเนื้อหา, ตรงนี้เป็นเนื้อหา'
              ได้ และยังทำให้มองดูเหมือนกับภาษาอังกฤษที่อ่านได้ปกติ
              ปัจจุบันมีแพ็กเกจของซอฟท์แวร์การทำสื่อสิ่งพิมพ์
              และซอฟท์แวร์การสร้างเว็บเพจ (Web Page Editor) หลายตัวที่ใช้ Lorem
              Ipsum เป็นแบบจำลองเนื้อหาที่เป็นค่าตั้งต้น
              และเวลาที่เสิร์ชด้วยคำว่า 'lorem ipsum'
              ผลการเสิร์ชที่ได้ก็จะไม่พบบรรดาเว็บไซต์ที่ยังคงอยู่ในช่วงเริ่มสร้างด้วย
              โดยหลายปีที่ผ่านมาก็มีการคิดค้นเวอร์ชั่นต่างๆ ของ Lorem Ipsum
              ขึ้นมาใช้ บ้างก็เป็นความบังเอิญ บ้างก็เป็นความตั้งใจ (เช่น
              การแอบแทรกมุกตลก) มันมีที่มาอย่างไร?
              ตรงกันข้ามกับความเชื่อที่นิยมกัน Lorem Ipsum
              ไม่ได้เป็นเพียงแค่ชุดตัวอักษรที่สุ่มขึ้นมามั่วๆ
              แต่หากมีที่มาจากวรรณกรรมละตินคลาสสิกชิ้นหนึ่งในยุค 45
              ปีก่อนคริสตศักราช ทำให้มันมีอายุถึงกว่า 2000 ปีเลยทีเดียว ริชาร์ด
              แมคคลินท็อค ศาสตราจารย์ชาวละติน จากวิทยาลัยแฮมพ์เด็น-ซิดนีย์
              ในรัฐเวอร์จิเนียร์ นำคำภาษาละตินคำว่า consectetur
              ซึ่งหาคำแปลไม่ได้จาก Lorem Ipsum ตอนหนึ่งมาค้นเพิ่มเติม
              โดยตรวจเทียบกับแหล่งอ้างอิงต่างๆ ในวรรณกรรมคลาสสิก
              และค้นพบแหล่งข้อมูลที่ไร้ข้อกังขาว่า Lorem Ipsum นั้นมาจากตอนที่
              1.10.32 และ 1.10.33 ของเรื่อง "de Finibus Bonorum et Malorum" (The
              Extremes of Good and Evil) ของ ซิเซโร ที่แต่งไว้เมื่อ 45
              ปีก่อนคริสตศักราช
              หนังสือเล่มนี้เป็นเรื่องราวที่ว่าด้วยทฤษฎีแห่งจริยศาสตร์
              ซึ่งเป็นที่นิยมมากในยุคเรเนสซองส์ บรรทัดแรกของ Lorem Ipsum "Lorem
              ipsum dolor sit amet.." ก็มาจากบรรทัดหนึ่งในตอนที่ 1.10.32 นั่นเอง
              ด้านล่างของหน้านี้คือท่อนมาตรฐานของ Lorem Ipsum
              ที่ใช้กันมาตั้งแต่คริสตศตวรรษที่
              16ที่ได้รับการสร้างขึ้นใหม่สำหรับผู้ที่สนใจ ประกอบไปด้วย ตอนที่
              1.10.32 และ 1.10.33 จากเรื่อง "de Finibus Bonorum et Malorum"
              โดยซิเซโร
              ก็ได้รับการผลิตขึ้นใหม่ด้วยเช่นกันในรูปแบบที่ตรงกับต้นฉบับ
              ตามมาด้วยเวอร์ชั่นภาษาอังกฤษจากการแปลของ เอช แร็คแคม เมื่อปี ค.ศ.
              1914
            </div>
          </b-col>
        </b-row>
      </div>
      <div class="button">
        <router-link to="/customer-info" class="btn btn-buy">ซื้อผลิตภัณฑ์</router-link>
      </div>
    </b-row>
  </div>
</template>

<style scoped>
hr {
  margin: 5px 0;
  width: 85%;
  background-color: #c4c4c4;
}
.inside {
  height: 800px;
  margin-top: 30px;
  font-size: 15px;
  text-align: left;
  overflow-x: hidden;
  overflow-y: scroll;
}
.inside .col-lg-9 {
  padding-right: 35px;
}
.inside::-webkit-scrollbar-track {
  border-radius: 10px;
  background-color: #f5f5f5;
  box-shadow: inset 0 0 6px rgba(116, 116, 116, 0.3);
}
.inside::-webkit-scrollbar {
  width: 7px;
  background-color: #f5f5f5;
}
.inside::-webkit-scrollbar-thumb {
  border-radius: 10px;
  background-color: rgb(148, 148, 148);
  box-shadow: inset 0 0 6px rgba(0, 0, 0, 0.3);
}
.button {
    width: 95%;
    display: flex;
    justify-content: flex-end;
    margin-top: 20px;
}
.btn-buy {
    color: #ffffff;
    background-color: #000000;
    box-shadow: 2px 3px 3px 0px #b4b4b4;
}
.btn-buy:hover{
    box-shadow: 2px 3px 3px 0px #797979;
}
</style>
